In [5]:
import pandas as pd
import sqlalchemy

In [7]:
engine= sqlalchemy.create_engine('mysql+pymysql://root:root123@localhost:3306/application')

In [11]:
df=pd.read_sql_table("customers",engine,columns=["name","phone_number"])

In [12]:
df

     name phone_number
0  Donald   7326784567
1    Bill   6573489999
2    Modi   4567895646